In [2]:
%reload_ext sql

In [3]:
%%sql mysql+pymysql://root:MyN3wP4ssw0rd@localhost:3306/hrx

SELECT 1+1;

1 rows affected.

[(2,)]

# Q-1 What is the gender breakdown employee in the company?

In [4]:
%%sql
SELECT
  gender,
  COUNT(*) AS Emp_Count
FROM hr
WHERE termdate = ""
GROUP BY 1

 * mysql+pymysql://root:***@localhost:3306/hrx
3 rows affected.

[('Male', 9328), ('Female', 8455), ('Non-Conforming', 502)]

# Q- 2 what is the race/ ethnicity breakdown of employee in the company?

In [18]:
%%sql
SELECT
  race,
  COUNT(*) AS Emp_count
FROM hr
WHERE termdate = ""
GROUP BY 1
ORDER BY 2 DESC;

 * mysql+pymysql://root:***@localhost:3306/hrx
7 rows affected.

[('White', 5214),
 ('Two or More Races', 2989),
 ('Black or African American', 2983),
 ('Asian', 2936),
 ('Hispanic or Latino', 2074),
 ('American Indian or Alaska Native', 1098),
 ('Native Hawaiian or Other Pacific Islander', 991)]

# Q- 3 What is the age distribution of employee in the company ?

In [21]:
%%sql
SELECT
  CASE
    WHEN age < 35 THEN "21-34"
    WHEN age < 45 THEN "35-44"
    WHEN age < 55 THEN "45-54"
    ELSE "50+"
  END AS Age_distributon,
  COUNT(*) AS Emp_count
FROM hr
GROUP BY 1
ORDER BY 1;

 * mysql+pymysql://root:***@localhost:3306/hrx
4 rows affected.

[('21-34', 8300), ('35-44', 6047), ('45-54', 6004), ('50+', 1863)]

# Q- 4 What is the average length of employment for employees who have terminated ?

In [32]:
%%sql
SELECT
  AVG(YEAR(termdate) - YEAR(hire_date)) AS avg_date_of_termination
FROM hr
WHERE termdate IS NOT NULL
AND termdate <= curdate()

 * mysql+pymysql://root:***@localhost:3306/hrx
1 rows affected.

[(Decimal('7.5819'),)]

# Q- 5 How does gender distribusion vary accross department and job title ?

In [4]:
%%sql
SELECT
  department,
  gender,
  COUNT(*) AS Emp_count
FROM hr
WHERE termdate = ""
GROUP BY 1,
         2
ORDER BY 1 limit 5

 * mysql+pymysql://root:***@localhost:3306/hrx
5 rows affected.

[('Accounting', 'Female', 1234),
 ('Accounting', 'Male', 1437),
 ('Accounting', 'Non-Conforming', 76),
 ('Auditing', 'Female', 20),
 ('Auditing', 'Male', 20)]

# Q- 6 What is distribution of job title across the company ?

In [5]:
%%sql
SELECT
  jobtitle,
  COUNT(*) AS Emp_count
FROM hr
WHERE termdate = ""
GROUP BY 1
ORDER BY 2 DESC limit 5

 * mysql+pymysql://root:***@localhost:3306/hrx
5 rows affected.

[('Research Assistant II', 634),
 ('Business Analyst', 574),
 ('Human Resources Analyst II', 495),
 ('Research Assistant I', 434),
 ('Account Executive', 409)]

# Q- 7 Which department has the highest turnover rate ?

In [48]:
%%sql
SELECT  department, 
SUM(IF(termdate<>"" AND termdate<curdate(),1,0)) AS Emp_leave, 
count(*) as Total_emp,
SUM(IF(termdate<>"" AND termdate<curdate(),1,0))*100/COUNT(*) as ternover_rate  
FROM hr 
GROUP BY 1 
ORDER BY 4 DESC

 * mysql+pymysql://root:***@localhost:3306/hrx
13 rows affected.

[('Auditing', Decimal('8'), 52, Decimal('15.3846')),
 ('Legal', Decimal('39'), 311, Decimal('12.5402')),
 ('Research and Development', Decimal('124'), 1084, Decimal('11.4391')),
 ('Training', Decimal('193'), 1692, Decimal('11.4066')),
 ('Engineering', Decimal('734'), 6686, Decimal('10.9782')),
 ('Human Resources', Decimal('198'), 1807, Decimal('10.9574')),
 ('Accounting', Decimal('362'), 3333, Decimal('10.8611')),
 ('Sales', Decimal('198'), 1832, Decimal('10.8079')),
 ('Services', Decimal('179'), 1686, Decimal('10.6168')),
 ('Product Management', Decimal('68'), 641, Decimal('10.6084')),
 ('Support', Decimal('98'), 954, Decimal('10.2725')),
 ('Business Development', Decimal('153'), 1642, Decimal('9.3179')),
 ('Marketing', Decimal('44'), 494, Decimal('8.9069'))]

# Q- 8 What is the distribution of employee accross city and state?

In [49]:
%%sql
SELECT
  location_state,
  COUNT(*) AS Employee_distribution
FROM hr
WHERE termdate = ""
OR termdate > curdate()
GROUP BY 1
ORDER BY 1

 * mysql+pymysql://root:***@localhost:3306/hrx
7 rows affected.

[('Illinois', 782),
 ('Indiana', 625),
 ('Kentucky', 399),
 ('Michigan', 606),
 ('Ohio', 16051),
 ('Pennsylvania', 1009),
 ('Wisconsin', 343)]

# Q- 9 How has the company employee count chaned over time based on hire and term date ?

In [50]:
%%sql
WITH sub
AS (SELECT
  YEAR(hire_date) AS year,
  COUNT(*) AS hire,
  SUM(CASE
    WHEN termdate <> "" AND
      termdate < curdate() THEN 1
    ELSE 0
  END) AS termination
FROM hr
GROUP BY 1)
SELECT
  year,
  hire,
  termination,
  (hire - termination) AS Emp_count,
  ROUND((hire - termination) * 100 / hire, 2) AS rate
FROM sub
ORDER BY year DESC

 * mysql+pymysql://root:***@localhost:3306/hrx
21 rows affected.

[(2020, 1012, Decimal('23'), Decimal('989'), Decimal('97.73')),
 (2019, 1083, Decimal('47'), Decimal('1036'), Decimal('95.66')),
 (2018, 1147, Decimal('44'), Decimal('1103'), Decimal('96.16')),
 (2017, 1091, Decimal('52'), Decimal('1039'), Decimal('95.23')),
 (2016, 1122, Decimal('63'), Decimal('1059'), Decimal('94.39')),
 (2015, 1059, Decimal('71'), Decimal('988'), Decimal('93.30')),
 (2014, 1053, Decimal('85'), Decimal('968'), Decimal('91.93')),
 (2013, 1105, Decimal('93'), Decimal('1012'), Decimal('91.58')),
 (2012, 1103, Decimal('106'), Decimal('997'), Decimal('90.39')),
 (2011, 1101, Decimal('112'), Decimal('989'), Decimal('89.83')),
 (2010, 1099, Decimal('125'), Decimal('974'), Decimal('88.63')),
 (2009, 1140, Decimal('146'), Decimal('994'), Decimal('87.19')),
 (2008, 1108, Decimal('141'), Decimal('967'), Decimal('87.27')),
 (2007, 1090, Decimal('145'), Decimal('945'), Decimal('86.70')),
 (2006, 1118, Decimal('177'), Decimal('941'), Decimal('84.17')),
 (2005, 1097, Decimal('173'), Decimal('924'), Decimal('84.23')),
 (2004, 1135, Decimal('195'), Decimal('940'), Decimal('82.82')),
 (2003, 1142, Decimal('193'), Decimal('949'), Decimal('83.10')),
 (2002, 1067, Decimal('173'), Decimal('894'), Decimal('83.79')),
 (2001, 1122, Decimal('203'), Decimal('919'), Decimal('81.91')),
 (2000, 220, Decimal('31'), Decimal('189'), Decimal('85.91'))]

# Q- 10 What is the tenure distribution for each department ?

In [51]:
%%sql
SELECT
  department,
  ROUND (AVG (DATEDIFF (termdate, hire_date) / 365), 0) AS Department_Wise_tenure
FROM hr
WHERE termdate <> ""
AND termdate < curdate()
GROUP BY 1
ORDER BY 2

 * mysql+pymysql://root:***@localhost:3306/hrx
13 rows affected.

[('Product Management', Decimal('6')),
 ('Human Resources', Decimal('7')),
 ('Business Development', Decimal('7')),
 ('Training', Decimal('7')),
 ('Support', Decimal('7')),
 ('Legal', Decimal('7')),
 ('Engineering', Decimal('8')),
 ('Services', Decimal('8')),
 ('Auditing', Decimal('8')),
 ('Marketing', Decimal('8')),
 ('Accounting', Decimal('8')),
 ('Research and Development', Decimal('8')),
 ('Sales', Decimal('9'))]